# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет 
# с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна 
# сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, 
# которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

lucky = int(input('Input six number:'))
first = lucky // 1000
second = lucky % 1000
sum1 = 0
sum2 = 0
while first > 0:
    x = first % 10
    sum1 = sum1 + x
    first = first // 10
while second > 0:
    x = second % 10
    sum2 = sum2 + x
    second = second // 10
if sum1 == sum2:
    print('Yes')
else:
    print('No')